[
    {
        "episodeNumber" : 1,
        "name" : "To You, in 2000 Years: The Fall of Shiganshina, Part 1" ,
        "releaseDate" : "2013-04-07",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/f/f8/Carla_Jaeger%27s_death.jpg/revision/latest/scale-to-width-down/200?cb=20170731070804",
        "summary" : "One hundred years after the appearance of the Titans, humanity receives a grim reminder of the threat that the Titans pose. Under the belief that they were safe behind the Walls, a Colossal Titan peers over the Walls and breaks the Wall. A young boy and his friend do what they can to save the boy's mother, trapped below the debris of their fallen house, but they are forced to flee when a disturbing Titan appears. The boy watches as, before his eyes, the Titan picks her up and eats her.",
        "introSong" : "Feuerroter Pfeil und Bogen",
        "outroSong" : "Utsukushiki Zankoku na Sekai" ,
        "comments" : null
    },

    {
        "episodeNumber" : 2,
        "name" : "That Day: The Fall of Shiganshina, Part 2",
        "releaseDate" : "2013-04-14",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/e/e9/Armored_Titan%27s_appearance.png/revision/latest/scale-to-width-down/200?cb=20130618170835",
        "summary" : "Titans continue to kill the citizens of Shiganshina as Eren, Mikasa, and Armin escape with their lives. After an Armored Titan breaks through the inner gate, Eren vows to kill all the Titans in the world. A year after Armin's grandfather perishes in an operation to retake Wall Maria, the three children join the military as part of the 104th Cadet Corps.",
        "introSong" :"Feuerroter Pfeil und Bogen" ,
        "outroSong" :"Utsukushiki Zankoku na Sekai" ,
        "comments" : null
    },

    {
        "episodeNumber" : 3,
        "name" : "A Dim Light Amid Despair: Humanity's Comeback, Part 1",
        "releaseDate" :"2013-04-21" ,
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/9/9a/Sasha_eating_a_potato.jpg/revision/latest?cb=20170731074223",
        "summary" :"After a brutal introduction to their commandant Keith Sadies, the cadets learn of Eren's past and his dreams. Eren later finds difficulty training with ODM gear, though with some motivation from his new friends he is able to overcome his struggle. The commandant later reveals that his belt was somehow broken, and Eren finds no difficulty training with functional gear." ,
        "introSong" :"Feuerroter Pfeil und Bogen" ,
        "outroSong" :"Utsukushiki Zankoku na Sekai" ,
        "comments" : null
    },

    {
        "episodeNumber" : 4,
        "name" : "The Night of the Closing Ceremony: Humanity's Comeback, Part 2" ,
        "releaseDate" : "2013-04-28",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/6/62/Colossal_Titan_reappears.png/revision/latest/scale-to-width-down/200?cb=20190312194921",
        "summary" :"In the last days of their training, Eren learns to spar with Annie as she notes the absurd system the military operates by. Eren later uses Annie's technique against Jean during an argument. After graduation, the cadets think about which military regiment they will enlist in, and Eren's speech convinces many to consider the Scouts. However, the day after graduation, the Colossal Titan suddenly appears at Trost." ,
        "introSong" :"Feuerroter Pfeil und Bogen" ,
        "outroSong" :"Utsukushiki Zankoku na Sekai" ,
        "comments" : null
    },

    {
        "episodeNumber" : 5,
        "name" :"First Battle: The Struggle for Trost, Part 1",
        "releaseDate" :"2013-05-05" ,
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/4/4c/Eren_inside_the_Titan%27s_mouth.png/revision/latest/scale-to-width-down/200?cb=20180606224451",
        "summary" : "Eren's fight with the Colossal Titan comes to an abrupt halt when the creature vanishes without a trace. The cadets are entrusted with the defense of the city, causing many to panic or lose hope, and Mikasa worries for Eren's life. When the battle begins, Eren's squad is quickly decimated by the invading Titans. Armin is saved from the brink of death by Eren, but Eren is eaten in his place.",
        "introSong" :"Feuerroter Pfeil und Bogen" ,
        "outroSong" :"Utsukushiki Zankoku na Sekai" ,
        "comments" : null
    },

    {
        "episodeNumber" : 6,
        "name" :"The World the Girl Saw: The Struggle for Trost, Part 2" ,
        "releaseDate" : "2013-05-12",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/8/87/Armin_in_shock_from_Eren%27s_death.jpg/revision/latest/scale-to-width-down/200?cb=20170805153459",
        "summary" :"Eren's death weighs heavily on Armin's mind while Mikasa forcefully persuades a merchant boss to allow the civilians to evacuate the district before his goods. She recalls the day six years ago when Eren saved her from bandits who killed her parents, the day she received her scarf and began considering Eren as family." ,
        "introSong" :"Feuerroter Pfeil und Bogen" ,
        "outroSong" :"Utsukushiki Zankoku na Sekai" ,
        "comments" : null
    },

    {
        "episodeNumber" : 7,
        "name" : "Small Blade: The Struggle for Trost, Part 3",
        "releaseDate" : "2013-05-19",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/e/ef/Rogue_Titan_strikes.png/revision/latest/scale-to-width-down/200?cb=20130730190726",
        "summary" : "Things turn bleak for the cadets when headquarters is overrun by Titans, leaving them unable to resupply before evacuation. After Mikasa learns of Eren's death, she leads a reckless charge for HQ but gets separated from the others. She nearly accepts her imminent death until she finds the will to fight, but she is miraculously saved with the arrival of a mysterious Titan that fights other Titans, a manifestation of humanity's rage.",
        "introSong" :"Feuerroter Pfeil und Bogen" ,
        "outroSong" :"Utsukushiki Zankoku na Sekai" ,
        "comments" : null
    },

    {
        "episodeNumber" :8 ,
        "name" : "I Can Hear His Heartbeat: The Struggle for Trost, Part 4",
        "releaseDate" : "2013-05-26",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/e/e8/Crying_Mikasa_and_Eren.png/revision/latest/scale-to-width-down/200?cb=20130602150607",
        "summary" : "As Jean leads the cadets to the Trost HQ, the mysterious Titan is lured there by Mikasa, Armin, and Conny. The Titan fights the others outside while the cadets enact a strategy to clear out the Titans from the supply room. After resupplying, some cadets notice the mysterious Titan collapsing from exhaustion after killing the remaining Titans. Miraculously, Eren Jaeger emerges unconscious from the Titan's nape, alive and healed.",
        "introSong" :"Feuerroter Pfeil und Bogen" ,
        "outroSong" :"Utsukushiki Zankoku na Sekai" ,
        "comments" : null
    },

    {
        "episodeNumber" : 9,
        "name" : "Whereabouts of His Left Arm: The Struggle for Trost, Part 5",
        "releaseDate" : "2013-06-02" ,
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/b/bd/Eren_triggers_his_Titan_power.png/revision/latest/scale-to-width-down/200?cb=20170829073827",
        "summary" : "The Scouts on a scouting mission beyond Wall Rose receive news of the attack on Trost, and Commander Erwin orders for an immediate retreat. Meanwhile, Eren is brought before the leaders of the Garrison to answer for his sudden Titan powers. Eren attempts to convince the captain that he is human, but his words fall on deaf ears. When the captain orders the artillery crew to fire upon Eren, he transforms into a partial Titan to shield his friends from the blast.",
        "introSong" :"Feuerroter Pfeil und Bogen" ,
        "outroSong" :"Utsukushiki Zankoku na Sekai" ,
        "comments" : null
    },

    {
        "episodeNumber" : 10,
        "name" : "Response: The Struggle for Trost, Part 6",
        "releaseDate" : "2013-06-09",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/9/93/Armin%27s_pride_as_a_soldier.png/revision/latest/scale-to-width-down/200?cb=20130609155701",
        "summary" : "Eren's sudden transformation comes as a shock to both the Garrison and his fellow cadets. Armin decides to put his life on the line and argue for Eren's sake before the captain, but the man is unmoved. However, the confrontation is resolved with the arrival of Commander Pyxis, who desires to follow the plan which Armin has devised to seal the breach in Wall Rose.",
        "introSong" :"Feuerroter Pfeil und Bogen" ,
        "outroSong" :"Utsukushiki Zankoku na Sekai" ,
        "comments" : null
    },

    {
        "episodeNumber" : 11,
        "name" : "Idol: The Struggle for Trost, Part 7",
        "releaseDate" :"2013-06-16" ,
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/7/7a/Titan_Eren_attacks_Mikasa.png/revision/latest/scale-to-width-down/200?cb=20130615205130",
        "summary" : "Commander Pyxis announces the plan to seal Wall Rose with a boulder in the city, but the soldiers and cadets are reluctant to follow. Given the dire circumstances, Pyxis convinces the troops to take the risk. Under the command of the Garrison elite squad, Eren approaches the boulder while the other soldiers distract the Titans. However, upon transforming into his Titan form, he immediately attacks Mikasa.",
        "introSong" :"Feuerroter Pfeil und Bogen" ,
        "outroSong" :"Utsukushiki Zankoku na Sekai" ,
        "comments" : null
    },

    {
        "episodeNumber" :12 ,
        "name" :"Wound: The Struggle for Trost, Part 8" ,
        "releaseDate" :"2013-06-23" ,
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/4/43/Mikasa_tries_to_talk_to_Eren.png/revision/latest/scale-to-width-down/200?cb=20130623122939",
        "summary" : "Eren's sudden assault causes conflict among the Garrison elite squad, though Ian believes it is best to defend Eren at all costs. Meanwhile, the cadets continue to distract the Titans in the city, though Jean's ODM gear malfunctions and he is cornered. Seeing flares signalling failure, Armin travels to Eren and speaks to him by cutting into his Titan's nape, reminding him of his dreams to see the outside world. His willpower rekindled, Eren's Titan begins to heal its wounds.",
        "introSong" :"Feuerroter Pfeil und Bogen" ,
        "outroSong" :"Utsukushiki Zankoku na Sekai" ,
        "comments" : null
    },

    {
        "episodeNumber" :13 ,
        "name" :"Primal Desire: The Struggle for Trost, Part 9" ,
        "releaseDate" : "2013-06-30",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/e/e4/Levi_to_the_rescue.png/revision/latest/scale-to-width-down/200?cb=20180606212358",
        "summary" : "After the skirmishes between the cadets and the Titans come to a close, the soldiers of Trost see Eren carrying the boulder to the breach and defend him with their lives. Once the breach is sealed, the Scout Regiment arrives to assist in clearing out the remaining Titans. After the battle, the cadets assist in clearing out the corpses, and Jean finds Marco's body. Some time later, Eren awakens in a cell supervised by Commander Erwin and Captain Levi, who accepts him into the Scouts.",
        "introSong" :"Feuerroter Pfeil und Bogen" ,
        "outroSong" :"Utsukushiki Zankoku na Sekai" ,
        "comments" : null
    },

    {
        "episodeNumber" : 13.5,
        "name" :"Since That Day" ,
        "releaseDate" : "2013-07-07",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/1/12/The_Colossal_Titan_appears_to_breach_the_Wall.png/revision/latest/scale-to-width-down/350?cb=20180721210006",
        "summary" : " This episode recapitulates the events of the previous 13 episodes of the anime.",
        "introSong" : "Feuerroter Pfeil und Bogen",
        "outroSong" : "Utsukushiki Zankoku na Sekai",
        "comments" : null
    },

    {
        "episodeNumber" : 14,
        "name" : "Can't Look into His Eyes Yet: Eve of the Counterattack, Part 1",
        "releaseDate" : "2013-07-14",
        "img" :"https://static.wikia.nocookie.net/shingekinokyojin/images/8/8a/Levi_beats_up_Eren.png/revision/latest/scale-to-width-down/200?cb=20180606212213" ,
        "summary" : "Eren is brought before a military tribunal that will determine his fate as a soldier for humanity. The Military Police Regiment wishes to thoroughly investigate Eren's Titan nature before killing him to appease the people, whereas the Scout Regiment wishes to investigate and make use of Eren's Titan powers in an upcoming scouting mission. After heated debate from both sides, it is decided that Eren will be handed over to the Scouts.",
        "introSong" : "Die Flügel der Freiheit",
        "outroSong" : "great escape",
        "comments" : null
    },

    {
        "episodeNumber" :15 ,
        "name" : "Special Operations Squad: Eve of the Counterattack, Part 2",
        "releaseDate" :"2013-07-21" ,
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/b/ba/Erwin%27s_mysterious_question.png/revision/latest/scale-to-width-down/200?cb=20130721114956",
        "summary" : "Eren joins the Special Operations Squad of the Scout Regiment and is taken to an old Scout base where they will prepare for the upcoming scouting mission. He meets his squadmates and learns of the Titan research performed by Section Commander Hange. The next morning, the Scouts learn that Sawney and Beane, Hange's Titan test subjects, have been killed. As the Scouts wonder who is responsible, Commander Erwin asks Eren who the true enemy is.",
        "introSong" : "Die Flügel der Freiheit",
        "outroSong" : "great escape",
        "comments" : null
    },

    {
        "episodeNumber" : 16,
        "name" : "What Needs to be Done Now: Eve of the Counterattack, Part 3",
        "releaseDate" : "2013-07-28",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/6/6c/New_Survey_Corps_members.png/revision/latest/scale-to-width-down/200?cb=20170124000231",
        "summary" : "After the 104th cadets are investigated concerning the deaths of Sawney and Beane, they are presented with the choice of which regiment they will join. Commander Erwin, informing the cadets of the Scout Regiment's upcoming mission, urges for them to join their cause, and many cadets become official Scouts. Eren later reunites with his friends and learns of Marco's death. One month later, the Scouts set out from Calaneth District on the 57th Exterior Scouting Mission.",
        "introSong" : "Die Flügel der Freiheit",
        "outroSong" : "great escape",
        "comments" : null
    },

    {
        "episodeNumber" : 17,
        "name" :"Female Titan: The 57th Exterior Scouting Mission, Part 1" ,
        "releaseDate" : "2013-08-04",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/5/57/Armin_encounters_the_Female_Titan.png/revision/latest/scale-to-width-down/200?cb=20130803235754",
        "summary" :"Erwin's long distance enemy scouting formation proceeds towards Shiganshina as expected until Armin encounters a Female Titan. Joining Reiner and Jean, the three confront the Titan to buy the commander time. Reiner comes close to death in the Female's grip, but narrowly escapes with his life. Afterward, the Female Titan changes direction, heading for Eren's position in the formation." ,
        "introSong" : "Die Flügel der Freiheit",
        "outroSong" : "great escape",
        "comments" : null
    },

    {
        "episodeNumber" :18 ,
        "name" : "Forest of Giant Trees: The 57th Exterior Scouting Mission, Part 2",
        "releaseDate" : "2013-08-11",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/9/99/Female_Titan_chases_Eren.png/revision/latest/scale-to-width-down/200?cb=20170805153523",
        "summary" : "The Female Titan devastates the Scout Regiment in search for Eren, killing any soldier it comes across. Meanwhile, Commander Erwin redirects the formation into the Forest of Giant Trees. When Squad Levi enters the forest, they soon encounter the Female Titan. The squad begins to panic, asking Captain Levi for orders, though Levi seems level-headed in the dire situation.",
        "introSong" : "Die Flügel der Freiheit",
        "outroSong" : "great escape",
        "comments" : null
    },

    {
        "episodeNumber" : 19,
        "name" :"Bite: The 57th Exterior Scouting Mission, Part 3" ,
        "releaseDate" : "2013-08-18",
        "img" :"https://static.wikia.nocookie.net/shingekinokyojin/images/3/32/A_trapped_Female_Titan.png/revision/latest/scale-to-width-down/200?cb=20130818095010" ,
        "summary" : "While Squad Levi flees the Female Titan in the forest, Eren thinks back to the days when Hange experimented with his Titan abilities and his squad's trust in him was tested. Placing his faith in his comrades, he agrees to follow Captain Levi's orders to advance without confronting the Titan. The chase comes to an abrupt halt when the Female Titan runs right into Commander Erwin's trap, where it is caught with weaponized restraints. As the squad recovers, Levi joins the commander to discover the identity of the Female Titan.",
        "introSong" : "Die Flügel der Freiheit",
        "outroSong" : "great escape",
        "comments" : null
    },

    {
        "episodeNumber" :20 ,
        "name" : "Erwin Smith: The 57th Exterior Scouting Mission, Part 4",
        "releaseDate" : "2013-08-25",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/5/58/Gunther%27s_death.png/revision/latest/scale-to-width-down/200?cb=20130825134143",
        "summary" : "The Scouts worry over the thought of Titan spies in their midst as Commander Erwin makes attempts to extract the Female Titan's human form. However, the Female Titan uses a scream to attract nearby Titans which devour its body. Erwin worries that the human pilot has escaped in the steam. When the Scouts are ordered to retreat, a cloaked figure approaches Squad Levi in the air, killing Gunther.",
        "introSong" : "Die Flügel der Freiheit",
        "outroSong" : "great escape",
        "comments" : null
    },

    {
        "episodeNumber" : 21,
        "name" : "Crushing Blow: The 57th Exterior Scouting Mission, Part 5",
        "releaseDate" : "2013-09-01",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/a/a8/The_Female_Titan_eats_Eren.png/revision/latest/scale-to-width-down/200?cb=20170623115231",
        "summary" : "Trusting in the abilities of his comrades, Eren retreats as Squad Levi attacks a newly transformed Female Titan. However, its abilities catch the Scouts off-guard before all are killed one by one. In a rage, Eren transforms into his Titan form to battle the monster himself. Eren relentlessly assaults the Female Titan, but eventually he is defeated as Mikasa comes to his aid. Biting Eren out of his Titan's nape, the Female Titan retreats while Mikasa pursues it. Levi arrives afterward, joining Mikasa to pursue the Titan from a distance.",
        "introSong" : "Die Flügel der Freiheit",
        "outroSong" : "great escape",
        "comments" : null
    },

    {
        "episodeNumber" : 22,
        "name" : "The Defeated: The 57th Exterior Scouting Mission, Part 6",
        "releaseDate" : "2013-09-08",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/e/e7/Levi%27s_charge.png/revision/latest/scale-to-width-down/200?cb=20130910142647",
        "summary" : "Mikasa and Captain Levi pursue the Female Titan, deciding to rescue Eren and join in the retreat. Levi quickly overpowers the Female and rescues Eren, though he is injured in the process. The retreating Scouts are pursued by Titans, leading them to reluctantly toss the corpses of their dead from the carriages. Returning to Calaneth in bitter defeat, the Scouts are later ordered to transport Eren to the capital." ,
        "introSong" : "Die Flügel der Freiheit",
        "outroSong" : "great escape",
        "comments" : null
    },

    {
        "episodeNumber" : 23,
        "name" : "Smile: Assault on Stohess, Part 1",
        "releaseDate" : "2013-09-15",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/7/7b/Annie%27s_laugh.png/revision/latest/scale-to-width-down/200?cb=20180606214457",
        "summary" : "In Stohess District on eastern Wall Sina, Annie prepares to join her Military Police in a mission to escort Eren to the capital until she is pulled aside by Armin, who asks for her assistance in sneaking Eren away to safety. Hesitantly agreeing, Annie is led by Eren, Armin, and Mikasa to a tunnel leading underground. Annie refuses to follow the Scouts below, and their suspicions that Annie is the Female Titan are confirmed. Escaping capture, Annie transforms in the middle of the city.",
        "introSong" : "Die Flügel der Freiheit",
        "outroSong" : "great escape",
        "comments" : null
    },

    {
        "episodeNumber" : 24,
        "name" : "Mercy: Assault on Stohess, Part 2",
        "releaseDate" :"2013-09-22" ,
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/9/9f/Eren_transforms_in_Stohess.jpg/revision/latest/scale-to-width-down/200?cb=20170805153540",
        "summary" : "Recalling the meeting when the Scouts suspect the Female Titan's identity, Eren is too hesitant to transform into his Titan to fight Annie. Devising a plan to distract her, Mikasa and Armin split up to confront Annie, but Eren is crushed under the collapsing tunnel. The Scout Regiment engages in battle with the Female Titan while Jean and Armin attempt to convince Eren to fight. When Eren finally finds his resolve, he transforms into his Titan form and clashes with the Female Titan.",
        "introSong" : "Die Flügel der Freiheit",
        "outroSong" : "great escape",
        "comments" : null
    },

    {
        "episodeNumber" : 25,
        "name" : "Wall: Assault on Stohess, Part 3",
        "releaseDate" : "2013-09-29",
        "img" :"https://static.wikia.nocookie.net/shingekinokyojin/images/8/88/Annie_encased_in_a_crystal.png/revision/latest/scale-to-width-down/200?cb=20130928225159" ,
        "summary" : "The battle between Eren and Annie brings devastation to Stohess, leading up to a final struggle between the Titans near a damaged Wall Sina. Before she can be captured, Annie encases herself in a hardened crystal. While Eren and the Scouts recover, Commander Erwin answers to the mayor of the city for the chaos which ensued. Despite heavy losses and untold destruction, Erwin believes the capture of Annie Leonhart has brought humanity one step closer to understanding the true nature of the Titans.",
        "introSong" : "Die Flügel der Freiheit",
        "outroSong" : "great escape",
        "comments" : null
    },

    {
        "episodeNumber" : 26,
        "name" : "Beast Titan",
        "releaseDate" : "2017-04-01",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/a/a9/The_Beast_Titan_smiles.jpg/revision/latest/scale-to-width-down/350?cb=20170526214620",
        "summary" : "Hange interrogates Pastor Nick after discovering a Titan within the Wall, but gains no valuable information. 12 hours earlier, Titans are spotted southwards by Miche Zacharius, whilst watching suspect recruits. The soldiers ride out to warn civilians. Miche splits off to engage the spotted Titans alone. The main Scout contingent is warned of the invasion. Miche kills 5 of the 9 Titans, and goes to leave. However, a beast-like Titan throws his horse at him, causing him to fall to the ground. He is questioned by the Beast, but stays silent. It takes his ODM gear, and has the nearby Titans eat Miche.",
        "introSong" : "Opfert eure Herzen!",
        "outroSong" : "Yuugure no Tori",
        "comments" : null
    },

    {
        "episodeNumber" : 27,
        "name" : "I'm Home",
        "releaseDate" : "2017-04-08",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/3/34/Sasha_blinds_a_Titan.jpg/revision/latest/scale-to-width-down/200?cb=20170415044757",
        "summary" : "The Scout Regiment set out for Ehrmich to assist in the crisis, bringing Pastor Nick with them to try to convince him to talk. On the way, Armin theorizes about the Wall Titans. Earlier, whilst riding to alert citizens, Sasha remembers her past with her father after the fall of Wall Maria. At a village, Sasha saves a girl from a small Titan. She tells the child to run, and blinds the pursuing Titan to escape. She later reunites with her father, who had saved the child. Meanwhile, Conny arrives in his village, to see it in ruins. He rides to his house, but sees an immobile Titan laying atop it. ",
        "introSong" : "Opfert eure Herzen!",
        "outroSong" : "Yuugure no Tori",
        "comments" : null
    },

    {
        "episodeNumber" : 28,
        "name" : "Southwestward",
        "releaseDate" : "2017-04-15",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/0/09/The_scouts_begin_to_fight.jpg/revision/latest/scale-to-width-down/200?cb=20170423031801",
        "summary" :"Before the Scouts depart from Ragako, the Titan atop Conny's house welcomes him home. Later, Gelgar's and Nanaba's teams begin separately surveying the Wall for a breach. At night, the two Scout teams reunite, having found no breach in Wall Rose. They go to rest at Utgard castle. Hange explains how Eren may be able to seal the breach, and Nick refuses to talk after seeing refugees, but reveals who can. At Utgard, Reiner confronts Ymir, but is interrupted when Titans are spotted outside. The veterans engage the Titans, and the Scouts under Hange ride for Utgard." ,
        "introSong" : "Opfert eure Herzen!",
        "outroSong" : "Yuugure no Tori",
        "comments" : null
    },

    {
        "episodeNumber" :29 ,
        "name" : "Soldier",
        "releaseDate" : "2017-04-22",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/b/bb/Ymir_transforms_into_a_Titan.jpg/revision/latest/scale-to-width-down/200?cb=20170430011549",
        "summary" : "At Utgard, the Scouts engage the Titans. Earlier, Reiner visits Ymir and realizes she is able to read an unknown writing. When the tower is breached, the recruits are left to halt the Titans advance. After a close call, they barricade a door. Outside, the Scouts nearly finish off the Titans, but the Beast Titan begins throwing projectiles at them, and calls in reinforcements. The veteran Scouts are killed, leaving the recruits defenseless and lamenting their deaths. Then, Ymir jumps from the castle, transforming into a Titan.",
        "introSong" : "Opfert eure Herzen!",
        "outroSong" : "Yuugure no Tori",
        "comments" : null
    },

    {
        "episodeNumber" : 30,
        "name" : "Historia",
        "releaseDate" : "2017-04-29",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/a/a3/Christa_tells_Ymir_her_real_name.jpg/revision/latest/scale-to-width-down/200?cb=20170430042900",
        "summary" : "In a 104th training exercise, the cadets notice that three people are missing. In the blizzard, Christa drags Daz through the snow. Ymir realizes that Christa is an illegitimate noble, and sends her ahead whilst she takes Daz. At the base, Christa finds the others had miraculously survived. At Utgard, Ymir engages the Titans. During the fight, she tears down the tower, and rescues the other recruits. The Titans later emerge from the rubble, and begin to devour Ymir, until the Scouts arrive and cut them down. After the battle, Christa tells Ymir her real name - Historia.",
        "introSong" : "Opfert eure Herzen!",
        "outroSong" : "Yuugure no Tori",
        "comments" : null
    },

    {
        "episodeNumber" : 31,
        "name" : "Warrior",
        "releaseDate" :"2017-05-06" ,
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/6/68/Reiner_heals_his_wound.png/revision/latest/scale-to-width-down/200?cb=20170626054922",
        "summary" : "Atop Wall Rose, the Scouts prepare to regroup at Trost. Hange hopes for a co-operative future with Ymir, and Hannes admits they found no breach in the Wall. Reiner takes Eren aside, revealing his and Bertholdt's identities as the Armored and Colossal Titans, and requests Eren comes with them. Attempting to downplay his suspicion, Eren dismisses the claims, however, Reiner commits by regenerating a wound he sustained. He and Bertholdt are attacked by Mikasa, but manage to transform into their Titan forms, and grab Eren and Ymir. Betrayed, Eren transforms into his Titan.",
        "introSong" : "Opfert eure Herzen!",
        "outroSong" : "Yuugure no Tori",
        "comments" : null
    },

    {
        "episodeNumber" : 32,
        "name" : "Close Combat",
        "releaseDate" : "2017-05-13",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/1/12/Eren_tears_off_the_Armored_Titan%27s_arm.png/revision/latest/scale-to-width-down/200?cb=20170827031759",
        "summary" :"In his Titan form, Eren battles the Armored Titan while the Scout Regiment attacks the Colossal Titan. However, a whirlwind of steam coming from Bertholdt's Titan prevents them from coming close. Meanwhile, Eren is hopelessly overpowered until he recalls a special fighting technique he learned from Annie years ago. He gains the upper hand with Annie's maneuver, but a devastating interference from the Colossal Titan brings the fight to a sudden halt." ,
        "introSong" : "Opfert eure Herzen!",
        "outroSong" : "Yuugure no Tori",
        "comments" : null
    },

    {
        "episodeNumber" : 33,
        "name" : "The Hunters",
        "releaseDate" : "2017-05-20",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/d/d1/Eren_wakes_up_captured_with_Ymir.png/revision/latest/scale-to-width-down/200?cb=20180530160312",
        "summary" : "Facing defeat at the hands of the Colossal Titan, Eren is taken away by Reiner and Bertholdt. Word is sent to Commander Pyxis in Trost of the situation in Wall Rose, and Commander Erwin gathers Scout Regiment and Military Police reinforcements to assist in the crisis. At Wall Rose, Hannes comforts Mikasa and Armin, choosing to join them when the time comes to rescue Eren. When Erwin's reinforcements arrive, Hange theorizes on the traitors' new location, and the Scouts and MPs embark on a search for Eren and head for a Forest of Giant Trees.",
        "introSong" : "Opfert eure Herzen!",
        "outroSong" : "Yuugure no Tori",
        "comments" : null
    },

    {
        "episodeNumber" :34 ,
        "name" : "Opening",
        "releaseDate" : "2017-05-27",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/2/2d/Reiner%27s_persona_split.png/revision/latest/scale-to-width-down/200?cb=20170826072441",
        "summary" : "While the Scouts advance towards the Forest of Giant Trees, Eren and Ymir attempt to get answers from Reiner and Bertholdt. While receiving few answers, they discover that Reiner's personality has split under the pressure from living for two different goals. While Ymir wonders about the Warriors' goal and the reason for the Beast Titan's presence, Eren expresses his rage towards the traitors. The true enemy of humanity remains a mystery to Eren, though the Scouts are closing in on the forest with the intent of saving him from his fate.",
        "introSong" : "Opfert eure Herzen!",
        "outroSong" : "Yuugure no Tori",
        "comments" : null
    },

    {
        "episodeNumber" : 35,
        "name" : "Children",
        "releaseDate" : "2017-06-03",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/2/22/Cult_member_gets_turned_into_a_Titan.png/revision/latest/scale-to-width-down/200?cb=20210202151353",
        "summary" :"While Moblit makes a shocking discovery in Ragako, Erwin's scouting formation nears the Forest of Giant Trees. The Warriors make their escape, but Ymir desires to see Christa again. Seeing similarities in Christa's past and her own, Ymir refuses to cooperate with Reiner and Bertholdt until they agree to take Christa with them. The soldiers arrive shortly afterward, coming across Ymir's Titan. When Christa is captured by Ymir, the soldiers immediately begin pursuit." ,
        "introSong" : "Opfert eure Herzen!",
        "outroSong" : "Yuugure no Tori",
        "comments" : null
    },

    {
        "episodeNumber" : 36,
        "name" : "Charge",
        "releaseDate" : "2017-06-10",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/5/53/Armored_Titan_surrounded_by_Titans.png/revision/latest/scale-to-width-down/200?cb=20170610180228",
        "summary" : "After hearing Ymir's motives, Historia agrees to stay by her side. The pursuing soldiers close in on the Armored Titan and corner Bertholdt, who refuses to give up Eren. Erwin leads a hellish charge against the Warriors in which he is injured, though Eren is rescued. Reiner refuses to let him escape and begins throwing Titans into the retreating formation. When Eren and Mikasa are dismounted in the chaos, they come across the Titan that ate Eren's mother five years ago.",
        "introSong" : "Opfert eure Herzen!",
        "outroSong" : "Yuugure no Tori",
        "comments" : null
    },

    {
        "episodeNumber" : 37,
        "name" : "Scream",
        "releaseDate" : "2017-06-17",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/8/87/The_Titan_devours_Hannes.png/revision/latest/scale-to-width-down/200?cb=20170617154003",
        "summary" : "After Hannes is eaten by the Titan which killed Eren's mother, Eren suddenly unleashes an incredible power upon the Titan, causing the other Titans to swarm it and tear it to pieces before chasing Reiner and Bertholdt away. For her own reasons, Ymir leaves the Scouts and retreats with the Warriors. The Scouts later conclude that the Titans which invaded Wall Rose were in fact, the human citizens of Ragako. As Eren devotes himself to discovering how to use his newfound power, a recovering Erwin concludes that the truths of the world will soon be known.",
        "introSong" : "Opfert eure Herzen!",
        "outroSong" : "Yuugure no Tori",
        "comments" : null
    },

    {
        "episodeNumber" : 38,
        "name" : "Smoke Signal",
        "releaseDate" : "2018-07-23",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/f/f9/Levi_confronts_Kenny.png/revision/latest/scale-to-width-down/200?cb=20180711204048",
        "summary" : "In a cabin in Wall Rose, the top ten and Armin are surprised by their inclusion into Squad Levi. Eren is made to run some tests in Titan form, but fails to harden his body. Hange brings news of Pastor Nick's death at the hands of the interior MP's. The Scouts then flee to Trost after hearing from Erwin. The government is opposing the Scout Regiment, demanding custody of Eren and Historia. Levi runs a decoy strategy so Jean and Armin are abducted instead of the targets. Mikasa subdues the kidnappers as Levi watches Eren's hearse. While looking on, Levi is ambushed by an old adversary and his team.",
        "introSong" : "Red Swan",
        "outroSong" : null,
        "comments" : null
    },

    {
        "episodeNumber" :39 ,
        "name" : "Pain",
        "releaseDate" : "2018-07-30",
        "img" :"https://static.wikia.nocookie.net/shingekinokyojin/images/0/0a/Armin_shoots_a_gun.png/revision/latest/scale-to-width-down/200?cb=20180730103755" ,
        "summary" : "Levi fights his way out of Kenny's ambush, whose subordinates have taken control of the carriage holding Eren and Historia. He is joined by the rest of his squad in an attempt to rescue Eren and Historia, but they are eventually forced to retreat. Afterwards, Levi convinces Dimo Reeves to work for the Scout Regiment. Reeves lures two Interior Squad members into a trap set by Levi's squad, and they reveal under interrogation that the Reiss family is the true royal family. Kenny kills Dimo Reeves for his betrayal, while Rod Reiss reunites with his daughter, Historia.",
        "introSong" : "Red Swan",
        "outroSong" : "Requiem der Morgenröte",
        "comments" : null
    },

    {
        "episodeNumber" : 40,
        "name" : "Old Story",
        "releaseDate" : "2018-08-06",
        "img" :"https://static.wikia.nocookie.net/shingekinokyojin/images/6/64/Historia_helps_on_the_farm.png/revision/latest/scale-to-width-down/200?cb=20180805213511" ,
        "summary" : "Historia recounts the circumstances of how she grew up on a farm as an unwanted child with a distant mother. She saw her father, Rod Reiss, for the first time when he came to see her after Wall Maria fell, but men in black coats intervened before he could take her away. Rod had them spare Historia under the condition that she live a quiet life far away under the name 'Christa Lenz'. In the present day, Rod apologizes for that and informs Historia that she has royal blood and is the only person who can save humanity. Meanwhile, Erwin meets Pyxis and discusses the overthrow of the government. When Hange arrives, they inform Erwin about Historia's royal lineage, and he tells Pyxis his plan to expose the puppet government and install Historia as the new queen. As dawn breaks, Erwin is called outside by the First Interior Squad to account for the murder of Dimo Reeves. He names Hange as his successor before he leaves and shortly thereafter, he and the Scout Regiment are placed under arrest.",
        "introSong" : "Red Swan",
        "outroSong" : "Requiem der Morgenröte",
        "comments" : null
    },

    {
        "episodeNumber" : 41,
        "name" : "Trust",
        "releaseDate" : "2018-08-13",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/c/cb/Levi_interrogates_the_MP.png/revision/latest/scale-to-width-down/200?cb=20180814061451",
        "summary" :"Hitch Dreyse and Marlo Freudenberg are caught by Squad Levi and agree to help them bypass a Military Police checkpoint. Meanwhile, Hange Zoë rescues Flegel Reeves and with his help they are able to publicly expose the cover-up used by the Interior Squad to accuse the Scout Regiment of murdering Dimo Reeves. In Capital Mitras, Gerald interrogates Erwin Smith, but does not learn what the Scout Regiment knows. Nile Dawk arrives to tell Erwin about his audience with the King, and how they will announce his sentence then. Erwin warns him that he left something up to Dot Pyxis and when it happens, it will be up to Nile and 'them' to decide." ,
        "introSong" : "Red Swan",
        "outroSong" : "Requiem der Morgenröte",
        "comments" : null
    },

    {
        "episodeNumber" : 42,
        "name" : "Reply",
        "releaseDate" :"2018-08-20" ,
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/f/fe/Erwin%27s_manacles_are_removed.png/revision/latest/scale-to-width-down/200?cb=20180819204420",
        "summary" : "Erwin Smith defends the necessity of the Scout Regiment to the King and assembled nobles. Without the Scouts to fight against the Titans, humanity could face a civil war if the Walls were ever breached again, since there would not be enough food to feed both the people of Wall Sina and Wall Rose. However, his justifications fall on deaf ears and the nobles call for his execution. Before Erwin can be taken away, Anka Rheinberger announces that Wall Rose has been breached, forcing the nobles to confront the scenario Erwin just spoke of. Though Dot Pyxis calls for an evacuation of the civilians in Wall Rose, the nobles override his order and demand that the gates to Wall Sina be closed. Nile Dawk refuses, and Premier Dhalis Zachary arrives in time to agree. With all branches of the military turned against the Royal Government, they enact a coup d'état and the nobility is arrested. Despite their success though, Erwin expresses misgivings about the new path humanity has taken.",
        "introSong" : "Red Swan",
        "outroSong" : "Requiem der Morgenröte",
        "comments" : null
    },

    {
        "episodeNumber" : 43,
        "name" : "Sin",
        "releaseDate" : "2018-08-27",
        "img" :"https://static.wikia.nocookie.net/shingekinokyojin/images/d/d1/Historia_in_the_crystal_cavern.png/revision/latest/scale-to-width-down/200?cb=20180827025954" ,
        "summary" : "Eren Jaeger learns the history of how he obtained his Titan and how five years ago his father, Grisha Jaeger, slaughtered most of the Reiss family in order to obtain their power, which was held by Frieda Reiss, the elder half-sister of Historia Reiss. Meanwhile, the military learns that certain bloodlines are immune to the 'Scream' that can alter humanity's memories and that if they do not rescue Eren they may soon forget their coup d'état ever happened. Squad Levi arrives at the rural chapel above the underground one where Eren is being held. They prepare to attack while the Anti-Personnel Control Squad waits for them below.",
        "introSong" : "Red Swan",
        "outroSong" : "Requiem der Morgenröte",
        "comments" : null
    },

    {
        "episodeNumber" :44 ,
        "name" : "Wish",
        "releaseDate" :"2018-09-03" ,
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/9/91/Eren_asks_Historia_to_eat_him.png/revision/latest/scale-to-width-down/200?cb=20180902225642",
        "summary" : "Levi Ackermann, Hange Zoë, and their squad members battle against Kenny Ackermann and the Anti-Personnel Control Squad in the crystal caverns of the Underground Chapel. Hange is grievously injured by Caven, but overall the Scouts are successful enough to push their enemies back to their final defensive post. Meanwhile, Rod Reiss pressures his daughter Historia into using a syringe to transform into a Titan so she can eat Eren Jaeger and reclaim the Founding Titan his father had stolen from her sister Frieda. However, Historia realizes that inheriting the Founding Titan will not save anyone because even if her sister had the power to eradicate all the Titans, there is something about inheriting the power that prevents people from using it. She chooses to shatter the syringe and works to free Eren, but her father laps up the remaining fluid and transforms into a Titan.",
        "introSong" : "Red Swan",
        "outroSong" : "Requiem der Morgenröte",
        "comments" : null
    },

    {
        "episodeNumber" :45 ,
        "name" : "Outside the Walls of Orvud District",
        "releaseDate" : "2018-09-10",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/b/b3/Rod%27s_Titan_crawls_towards_Orvud.png/revision/latest/scale-to-width-down/200?cb=20180909201819",
        "summary" :"Rod Reiss transforms into a Titan so large that it begins to destroy the cavern in the Underground Chapel as it tries to stand. Historia Reiss refuses to abandon Eren Jaeger and get to safety, and Squad Levi arrives in time to help free him. However, the size and heat emanating from the Titan is so great that escape looks nearly impossible. Eren wallows in despair, but his friends refuse to give up, causing him to take a chance and use a bottle labeled 'Armor' that he spots on the ground. Ingesting its contents allow him to use a new hardening ability with his Titan that stabilizes the cavern around his friends so they can survive. Squad Levi meets up with Erwin Smith and the rest of the Scout Regiment outside. Rod's Titan is twice the size of the Colossal Titan and they cannot fight it conventionally. They rush to Orvud District where they will make a stand. While there, Levi Ackermann informs Historia that she is to become Queen after this to ensure the success of their coup d'état. She agrees, under one condition." ,
        "introSong" : "Red Swan",
        "outroSong" : "Requiem der Morgenröte",
        "comments" : null
    },

    {
        "episodeNumber" : 46,
        "name" : "Ruler of the Walls",
        "releaseDate" : "2018-09-17",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/2/25/Rod%27s_Titan_looming_over_the_Wall.png/revision/latest/scale-to-width-down/200?cb=20180916204214",
        "summary" : "The Orvud District Garrison prepares a defense against the gargantuan Titan form of Rod Reiss, but their cannons are ineffective and the Scout Regiment prepares a back-up strategy. They build a giant sack out of rope and netting, and stuff it full of barrels of gunpowder. Hange also prepares two carts loaded with gunpowder and equipped with ODM triggers to reel them into their targets when fired. ODM triggers to reel them into their targets when fired. When the Titan reaches the Wall it plants its hands on top and pulls itself upright, scattering the Garrison, which falls back. Its face has been scraped away by the ground while it was dragging itself. The Scouts take over the Wall's defense and shoot the gunpowder-laden carts into the Titan's hands, which explode, causing it to lose its grip. The Titan slumps over the Wall and Eren charges forward in his Titan form to shove the sack of gunpowder into its gaping mouth. This causes the Titan to explode and Historia Reiss slices the chunk of Titan flesh containing the nape, thus killing her father. She lands in the city below to the shock of the nearby citizens who ask if she is the one who saved them. Historia rises and declares herself the true ruler of the Walls.",
        "introSong" : "Red Swan",
        "outroSong" : "Requiem der Morgenröte",
        "comments" : null
    },

    {
        "episodeNumber" :47 ,
        "name" : "Friends",
        "releaseDate" : "2018-09-24",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/5/53/Uri_blocks_Kenny%27s_dagger.png/revision/latest/scale-to-width-down/200?cb=20180924045443",
        "summary" : "Years ago, Kenny Ackermann forged a lasting friendship with Uri Reiss, even though circumstances should have led to one killing the other. As Uri's confidant, Kenny became a part of the government, relieving the persecution of the Ackermann family and allowing him to look after the son of his deceased sister, Kuchel. Though Kenny was taken by Uri's sense of compassion, he found himself unable to understand what would allow a person to be that way, leading him to desire that power for himself and create the Anti-Personnel Control Squad to obtain it. Now dying, following the collapse of the Underground Chapel, Kenny tells an inquiring Levi how he is related to his mother and why he eventually left him behind. Kenny gives Levi a syringe he stole from Rod Reiss and passes away. Elsewhere in Capital Mitras, Historia Reiss is crowned as the new Queen.",
        "introSong" : "Red Swan",
        "outroSong" : "Requiem der Morgenröte",
        "comments" : null
    },

    {
        "episodeNumber" : 48,
        "name" : "Bystander",
        "releaseDate" : "2018-10-08",
        "img" : " https://static.wikia.nocookie.net/shingekinokyojin/images/0/03/Eren_tells_Grisha_and_Keith_about_Carla.png/revision/latest/scale-to-width-down/200?cb=20181008055645",
        "summary" : " Two months have passed since Historia Reiss's coronation. She has started a farm to take care of the orphans and the needy. The military has also been overhauled. They now have a new weapon that allows them to kill Titans without risking the lives of soldiers and new recruits have joined the Scout Regiment. At Jean Kirschtein's prompting, Eren Jaeger tries to remember the Scout who appeared in his father's memory and realizes that it is Commandant Keith Sadies of the Cadet Corps. Eren, his squad, Levi, and Hange visit Keith and hear his story of how he discovered Grisha Jaeger outside of Wall Maria twenty years ago. The two became friends, and Grisha inspired Keith to think he was special. However, Keith suffered many failures, both in his personal life and as an officer, and came to realize he was not special at all. He was with Grisha the night Wall Maria fell, and carried Eren out of the woods after Grisha had taken him there. Keith hoped that Eren would avoid becoming like his father, but even though he sabotaged Eren's training gear when he was a cadet, Eren would not give up. As Eren leaves in the present day, Keith realizes he could not change anything.",
        "introSong" : "Red Swan",
        "outroSong" : "Requiem der Morgenröte",
        "comments" : null
    },

    {
        "episodeNumber" : 49,
        "name" : "Night of the Battle to Retake the Wall",
        "releaseDate" : "2018-10-15",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/8/85/Erwin_begins_the_operation_to_retake_Wall_Maria.png/revision/latest/scale-to-width-down/200?cb=20181015040541",
        "summary" : "Erwin Smith and the Scout Regiment officers prepare for the operation to retake Wall Maria, suspecting that the truth of their world lies in the Jaeger family basement. Levi Ackermann tries to convince Erwin to remain behind due to the fact he is now handicapped by the loss of his arm, but Erwin refuses. The night before the operation, the Scouts have a party for all the soldiers in the mess hall where they are treated to a rare meal containing meat. This turns the soldiers rowdy. Sasha Braus needs to be restrained and Eren Jaeger gets into a fight with Jean Kirschtein. After the fight is broken up and the soldiers are told to go to bed, Eren shares his renewed optimism with Armin Arlelt and Mikasa Ackermann. The following day at sunset, the Scouts are sent off from Trost District by a cheering crowd.",
        "introSong" : "Red Swan",
        "outroSong" : "Requiem der Morgenröte",
        "comments" : null
    },

    {
        "episodeNumber" : 50,
        "name" : "The Town Where Everything Began",
        "releaseDate" : "2019-04-29",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/7/77/Reiner_is_attacked_by_Levi.png/revision/latest/scale-to-width-down/200?cb=20210701002733",
        "summary" : "The Scout Regiment arrives in Shiganshina District only to discover it is completely devoid of Titans. Eren Jaeger successfully plugs the outer gate leading to the exterior of the Walls, using his Titan's hardening ability and without encountering any enemy resistance. Armin Arlelt discovers signs of an enemy presence and leads a group of soldiers to search for their hiding place. They uncover Reiner Braun hiding inside the Wall itself, but Levi Ackermann is unable to kill him before Reiner transforms into the Armored Titan. Outside the district, the Beast Titan appears along with a small army of Titans. It hurls a boulder into the breach in the Wall's inner gate, closing off the district's only remaining ground exit and trapping the Scout Regiment's horses on the Titan side of the Wall. This cuts off the Scout Regiment's only way of escape, forcing them to face the Titans.",
        "introSong" : "Shoukei to Shikabane no Michi",
        "outroSong" : "Name of Love",
        "comments" : null
    },

    {
        "episodeNumber" : 51,
        "name" : "Thunder Spears",
        "releaseDate" : "2019-05-06",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/4/4b/Eren_strikes_the_Armored_Titan%27s_head.png/revision/latest/scale-to-width-down/200?cb=20190505200110",
        "summary" : "The Beast Titan sends its smaller Titans in to kill off the Scout Regiment's horses while the larger Titans form a semi-circle in front of the Wall to cut off escape from Shiganshina District. To protect the horses, Erwin Smith has the majority of Scouts defend the gate, and uses Eren Jaeger as bait to lure away Reiner Braun's Armored Titan. The Scouts at the gate struggle against the Titans due to the losses they have suffered over recent months, but inside Shiganshina, Eren creates an opportunity for the Scouts to use their new Thunder Spear weapons against the Armored Titan. Hange Squad and Levi Squad succeed in blinding the Armored Titan and destroying its nape.",
        "introSong" : "Shoukei to Shikabane no Michi",
        "outroSong" : "Name of Love",
        "comments" : null
    },

    {
        "episodeNumber" :52 ,
        "name" : "Descent",
        "releaseDate" : "2019-05-13",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/0/0c/Reiner_and_Bertholdt_part_ways.png/revision/latest/scale-to-width-down/200?cb=20190512232839",
        "summary" : "The Warriors prepare for the incoming Scout Regiment attack. At Zeke's orders, both Reiner Braun and Bertholdt Hoover put away their misgivings to focus on the task at hand. Reiner tells Bertholdt that he will need to be able to think on his own for this battle instead of waiting for Reiner to signal him, and the two agree that now is the time to settle everything once and for all. Though the Scout Regiment later manages to incapacitate Reiner by partially decapitating his human body while he is still in his Titan, he manages to roar, signaling the Beast Titan to throw the barrel containing Bertholdt into Shiganshina District. The Scouts scatter, but Bertholdt does not immediately transform into the Colossal Titan after seeing the extent of Reiner's injuries. He asks Reiner to lay on his back to protect himself and confronts the Scouts alone. Armin Arlelt tries talking Bertholdt down, but the latter refuses and admits he only agreed to talk as a way to test his own resolve and willingness to fight them. After Mikasa Ackermann fails to kill him, Bertholdt leaves and uses his omni-directional mobility gear to ascend high into the air where he transforms into the Colossal Titan.",
        "introSong" : "Shoukei to Shikabane no Michi",
        "outroSong" : "Name of Love",
        "comments" : null
    },

    {
        "episodeNumber" : 53,
        "name" : "Perfect Game",
        "releaseDate" :"2019-05-20" ,
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/f/f1/The_Beast_Titan_notices_the_signal_flares.png/revision/latest/scale-to-width-down/200?cb=20190525141802",
        "summary" : "The Scout Regiment battles on two fronts. Inside Shiganshina District, Jean Kirschtein takes over for Armin Arlelt in leading Levi Squad in an attempt to stop the Colossal Titan. However, Eren Jaeger's Titan is easily kicked away and Mikasa Ackermann is unable to land a hit, even using the new Thunder Spears. On the other side of the Wall, the Scouts are devastated by the Beast Titan's rock bombardment, leaving Erwin Smith, Levi Ackermann, and the new recruits as the only survivors. Realizing that they are likely to die, regardless of what happens, Erwin stakes everything on a final operation. He leads all the recruits on a decoy suicide charge towards the Beast Titan, so that Levi can approach undetected and kill it.",
        "introSong" : "Shoukei to Shikabane no Michi",
        "outroSong" : "Name of Love",
        "comments" : null
    },

    {
        "episodeNumber" : 54,
        "name" :"Hero" ,
        "releaseDate" : "2019-05-27",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/f/f2/Armin_tries_to_withstand_the_Colossal_Titan%27s_heat.png/revision/latest/scale-to-width-down/200?cb=20190527041349",
        "summary" : "Zeke finishes off the remainder of the Scout Regiment recruits and pities them for wasting their lives. However, he is startled by Levi Ackermann, whose arrival was hidden by the Scouts' diversionary charge. Levi soundly defeats Zeke's Beast Titan, but before he can use a Titan injection to feed Zeke to a surviving Scout, the Cart Titan attacks Levi and then runs away with Zeke. Zeke sends his remaining Titans to finish off Levi. Meanwhile, Armin Arlelt splits his squad into two teams. Most of the squad leaves to hold off the Armored Titan and succeeds, thanks to the timely reappearance of Hange Zoë. Armin wakes up Eren Jaeger who is comatose in his Titan, and relays a plan that will allow them to defeat Bertholdt Hoover's Colossal Titan. Eren falls off the Wall and pretends to be unconscious while Armin distracts Bertholdt and goads him into using up all his energy to burn him alive. When Armin finally collapses, Bertholdt moves on to deal with Eren, but discovers Eren has secretly used his hardening powers to plug the remaining hole in the Wall. Eren ambushes Bertholdt from behind with ODM gear, and cuts him out of his Titan's nape, ending the battle.",
        "introSong" : "Shoukei to Shikabane no Michi",
        "outroSong" : "Name of Love",
        "comments" : null
    },

    {
        "episodeNumber" : 55,
        "name" : "Midnight Sun",
        "releaseDate" : "2019-06-03",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/3/36/Levi_tries_to_reason_with_Mikasa.png/revision/latest/scale-to-width-down/200?cb=20190603044527",
        "summary" : "Zeke tells Eren Jaeger that someday he will come back to rescue him. Eren then realizes that Zeke strongly resembles his father, Grisha. Levi Ackermann arrives to pursue Zeke with Eren's remaining weapons, when Eren suddenly realizes that Armin Arlelt is breathing. Eren asks Levi for the Titan injection so they can save Armin by having him eat the incapacitated Bertholdt Hoover. However, Floch arrives with a dying Erwin Smith and request that the injection be used on Erwin. After losing Reiner Braun to the Cart Titan, Hange Zoë and the rest of Levi Squad arrive to find Eren and Mikasa Ackermann struggling with Levi for the injection, either with words or by force. Hange eventually manages to talk down Mikasa and Levi has everyone clear out so he can use the injection on Erwin. However, when Erwin begins muttering a childhood memory, Levi decides it would be kinder to let him pass on. He gives the injection to Armin who eats Bertholdt and emerges from his Pure Titan as his friends gather around.",
        "introSong" : "Shoukei to Shikabane no Michi",
        "outroSong" : "Name of Love",
        "comments" : null
    },

    {
        "episodeNumber" : 56,
        "name" : "The Basement",
        "releaseDate" : "2019-06-10",
        "img" :"https://static.wikia.nocookie.net/shingekinokyojin/images/e/e4/Eren_and_Mikasa_return_home.png/revision/latest/scale-to-width-down/200?cb=20190610063127" ,
        "summary" : "Armin Arlelt reluctantly comes to grips with the fact that he has eaten Bertholdt Hoover and that he was chosen for survival over Erwin Smith. Half of the remaining soldiers, including Eren Jaeger travel to his family's basement where they discover three journals and a photograph left behind by his father. The journals detail Grisha's life from beyond the Walls, where humanity has not perished and technology has progressed enough to allow humans to live elegant lives. He learned the truth of his own situation one day when he went out to see an airship along with his sister Fay.",
        "introSong" : "Shoukei to Shikabane no Michi",
        "outroSong" : "Name of Love",
        "comments" : null
    },

    {
        "episodeNumber" :57 ,
        "name" : "That Day",
        "releaseDate" : "2019-06-17",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/6/6c/Grisha_recognizes_Gross.png/revision/latest/scale-to-width-down/200?cb=20190617070736",
        "summary" : "Grisha Jaeger accepts a beating from Kruger for himself and on behalf of his sister for going outside the Liberio Internment Zone without permission. Gross supposedly escorts her home, but her body turns up in the river. Grisha's rage is fueled when he sees how meekly his father accepts the falsehood given to him by the Marley Public Security officer.As an adult, Grisha joins the Restorationists, where he meets his future wife. Dina Fritz. Together they have a son, Zeke, who they plan to make a Warrior in order to infiltrate Marley's mission to recover the Founding Titan. However, they are betrayed by Zeke and are sent to Paradis Island where they will be turned into Pure Titans. Though Dina is transformed, Grisha is saved at the last moment by Kruger, who reveals himself to be the Owl, the secretive leader of the Restorationists. Kruger tells Grisha to watch as he uses a knife to cut himself and transform into a Titan.",
        "introSong" : null,
        "outroSong" : "Name of Love",
        "comments" : null
    },

    {
        "episodeNumber" : 58,
        "name" : "Attack Titan",
        "releaseDate" : "2019-06-24",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/6/6c/Kruger_prepares_the_injection.png/revision/latest/scale-to-width-down/200?cb=20190624055244",
        "summary" : "Grisha Jaeger is consumed by regret over the loss of his family and his cause, but Eren Kruger convinces him to take up his mission and retake the Founding Titan from the King who refuses to use it to save the Eldian people. To do that, Kruger passes on his Titan to Grisha, calling it the Attack Titan. In present day, Eren Jaeger realizes that due to the 'Curse of Ymir' he has less than eight years to live, and Armin Arlelt has thirteen, since he just recently inherited the Colossal Titan. They attend a military audience to go over the findings in the basement and Hange Zoë says they may have to consider the rest of the world as their enemies due to the fact the people outside the Walls fear the Subjects of Ymir. When Hange discusses the fact that Eren was able to use the Founding Titan despite not being of royal blood, he realizes that he was only able to do so because he had touched the Titan form of Dina Fritz at that time. He keeps this information to himself out of fear of what the military might do to Historia Reiss if they knew.",
        "introSong" : "Shoukei to Shikabane no Michi",
        "outroSong" : "Name of Love",
        "comments" : null
    },

    {
        "episodeNumber" : 59,
        "name" : "The Other Side of the Wall",
        "releaseDate" : "2019-07-01",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/5/5c/Eren%2C_Armin%2C_and_Mikasa_at_the_sea.png/revision/latest/scale-to-width-down/200?cb=20201206154723",
        "summary" : "The royal government decides to release the information contained in Grisha Jaeger's journals to the general public, causing some chaos as people try to accept the news. Some do not. However, progress on killing Titans with the Executioner from Hell continues until there are scarcely any left, and refugees are allowed to resettle in Wall Maria. A year after the attack on Trost District and six years after the fall of Wall Maria, the Scout Regiment is able to launch an expedition past Wall Maria to explore the land outside. They see the wall where the Restorationists were turned into Titans, and eventually arrive at the sea; a body of salt water so vast it stretches to the horizon. Most of the Scouts are happy to play in the surf, but Eren Jaeger is pensive, knowing that this sight, one that he so longed for and idealized as a symbol of freedom, in reality offers no freedom at all, but that the other side of the sea is where their true enemies are.",
        "introSong" : "Shoukei to Shikabane no Michi",
        "outroSong" : "T-KT",
        "comments" : null
    },

    {
        "episodeNumber" :60 ,
        "name" : "The Other Side of the Sea",
        "releaseDate" : "2020-12-07",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/1/17/Titans_rain_down_on_Fort_Slava.png/revision/latest/scale-to-width-down/200?cb=20201209135958",
        "summary" : "Marley besieges Fort Slava, aiming to end their four-year conflict with the Mid-East Allied Forces sparked by their defeat in Shiganshina. Warrior candidate Falco Grice is saved by his brother Colt, who returns him to the trenches nearby. The presence of an armored train prevents Marley from deploying its Titans. Warrior candidate Gabi Braun is approved to destroy it by Marleyan Commander Magath, which she succeeds in through the use of perfidy. The deployment of Galliard and Pieck clears the Mid-East trenches, which allows their airborne operation to begin. Zeke Jaeger uses his Titan power to transform Eldians into Pure Titans, creating a powerful airstrike. The Armored Titan joins the battle, destroying the remaining anti-Titan artillery with the Jaw. With the fort secure, Zeke uses his Beast Titan's pitching to sink the naval fleet stationed nearby, however, artillery fire from the ships heavily damages the Armored Titan. A peace treaty is signed, but the battle's outcome reminds Marley of the growing need to acquire the Founding Titan.",
        "introSong" : "My War",
        "outroSong" : "Shock",
        "comments" : null
    },

    {
        "episodeNumber" :61 ,
        "name" : "Midnight Train",
        "releaseDate" : "2020-12-14",
        "img" :"https://static.wikia.nocookie.net/shingekinokyojin/images/9/96/Falco_helps_a_traumatized_soldier.png/revision/latest/scale-to-width-down/200?cb=20201214065047" ,
        "summary" : "Given how narrowly Marley achieved victory over the Mid-East Allied Forces, it is clear to Marley's military leaders that the era of their country's domination via Titan warfare is coming to an end. Marley plans to revive the Paradis Island Operation to capture the Founding Titan to buy a few more years for their military to restructure and modernize for a post-Titan reality. However, taking the island will be difficult as none of Marley's ships have returned for the past three years, making it clear that Paradis Island controls at least two of the Nine Titans. The Warriors and Warrior candidates return home to Liberio where they are reunited with their families. Reiner Braun shares some of his experiences on the island, confusing his cousin, Gabi, when he refers to meeting 'all sorts of people' there rather than universally condemning them. The next day, Zeke Jaeger informs the Warriors and Colt Grice of an upcoming festival in Liberio, where dignitaries will be invited from abroad. There, the Tybur family, holders of the War Hammer Titan, will announce the plan to take Paradis Island.",
        "introSong" :"My War" ,
        "outroSong" : "Shock",
        "comments" : null
    },

    {
        "episodeNumber" : 62,
        "name" : "The Door of Hope",
        "releaseDate" :"2020-12-21" ,
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/f/f1/Reiner_tries_to_commit_suicide.png/revision/latest/scale-to-width-down/200?cb=20201222235137",
        "summary" : "Reiner Braun recalls his youth when he trained as a Warrior so that his Eldian mother and Marleyan father could live together. Faced with many struggles and shortcomings, Reiner's dream kept his resolve alive. He recalls his final days in Warrior training when he, Bertholdt Hoover, Annie Leonhart, and Marcel Galliard were sent to Paradis Island to reclaim the Founding Titan. On their journey to the wall, Reiner learned that Marcel set him up to inherit the Armored Titan instead of his brother. Reiner's shock was worsened when, shortly afterward, a Titan consumed Marcel. The Warriors lost hope for their mission after Marcel's death, but Reiner's determination to live and succeed spurred his comrades on. Meanwhile, Falco Grice continues to struggle with his Warrior training, becoming more and more convinced that he has no hope of inheriting the Armored Titan and saving Gabi Braun's life. On his way home from the Warriors' headquarters, Falco meets a wounded soldier who wants to speak with him.",
        "introSong" :"My War" ,
        "outroSong" : "Shock",
        "comments" : null
    },

    {
        "episodeNumber" : 63,
        "name" : "From One Hand to Another",
        "releaseDate" :"2020-12-28" ,
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/0/0a/Falco_reunites_Reiner_and_Eren.png/revision/latest/scale-to-width-down/200?cb=20201227234822",
        "summary" : "Theo Magath meets with Willy Tybur, the head of the Tybur family, and finds they are of a similar mind when it comes to the current political state of Marley. They work together as Willy arranges for a festival to be held in Liberio's internment zone for ambassadors from around the world. He plans to announce his solution to the Titan scourge there. Meanwhile, Falco Grice has been delivering messages for Mr. Kruger and also manages to beat Gabi Braun in a race for the first time. However, she fails to understand his confession that he is trying so hard because he cares about her. Both Warriors and candidates enjoy the festival the day it arrives, and before the evening's theater production can begin, Falco asks Reiner Braun to come with him. He leads him to a basement where Mr. Kruger is waiting and Reiner recognizes him as Eren Jaeger.",
        "introSong" :"My War" ,
        "outroSong" : "Shock",
        "comments" : null
    },

    {
        "episodeNumber" : 64,
        "name" : "Declaration of War",
        "releaseDate" : "2021-01-11",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/f/f8/The_Attack_Titan_crushes_Willy.png/revision/latest/scale-to-width-down/200?cb=20210111013144",
        "summary" : "In the basement of a building behind the stage, Reiner Braun reunites with Eren Jaeger for the first time in four years. He is terrified that Eren has come back to exact revenge, but Eren is calm and explains that he is here for the same reason Reiner originally came to Paradis Island. He asks Reiner for the reason he attacked in the first place, and understanding his point of view, he concludes that the two of them are the same. Given their situations they did not have a choice, either then or now. On the stage itself, Willy Tybur puts on a theatrical production of Eldian history as it is known to the rest of the world, only to reveal that the true end of the Great Titan War was brought about by King Karl Fritz himself, who worked with the Tybur family to manufacture the story of Helos. The King isolated himself and his people on Paradis Island and made a vow to renounce war that would be imposed on his successors, which would have kept the world safe from Titans, except that the Founding Titan has now changed hands to Eren, who is not bound by the same restrictions as those of the royal bloodline. Willy asks the world to unite with him as he declares war on Paradis.",
        "introSong" :"My War" ,
        "outroSong" : "Shock",
        "comments" : null
    },

    {
        "episodeNumber" : 65,
        "name" : "The War Hammer Titan",
        "releaseDate" :"2021-01-18" ,
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/e/e1/The_Fight_of_the_Titans.png/revision/latest/scale-to-width-down/200?cb=20210118102917",
        "summary" : "Before the Liberio festival, Willy Tybur and Theo Magath are aware that their enemies are likely to attack the festival, and make plans to take advantage of this. In the present, Eren Jaeger's Attack Titan eats Willy and begins to massacre the festival attendees. Lara Tybur transforms into the War Hammer Titan to engage him, while the rescued Pieck and Porco Galliard witness the appearance of the Scout Regiment. The War Hammer Titan defeats Eren and asks for his last words, but he is saved by Mikasa Ackermann, who disables the Titan in a surprise attack. Meanwhile, Commander Magath orders the Marleyan military to converge upon Liberio in order to trap the enemy. Enraged by the deaths of Udo and Zofia, Gabi Braun heads towards the battlefield. As Mikasa reengages the reanimated War Hammer Titan, Eren discovers Lara Tybur's crystal controlling her Titan via a cable. He transforms again and severs the cable, but is attacked by the Jaw Titan before he can eat it. Eren is saved by Levi Ackermann, and Galliard is quickly surrounded by more Scouts.",
        "introSong" :"My War" ,
        "outroSong" : "Shock",
        "comments" : null
    },

    {
        "episodeNumber" : 66,
        "name" : "Assault",
        "releaseDate" : "2021-01-25",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/3/3e/Eren_prepares_to_use_the_Jaw_Titan_to_break_Lara%27s_crystal.png/revision/latest/scale-to-width-down/200?cb=20210125032430",
        "summary" : "The Scout Regiment and the Warriors face off as the Beast Titan joins the battle. Though Pieck is initially optimistic about Marley's chances, the arrival of Armin Arlelt's Colossal Titan changes the flow of combat when it wipes out all the military reinforcements in Liberio's port. Porco Galliard impulsively splits away from the group to attack Eren Jaeger, giving Levi Ackermann the opportunity to topple the Beast Titan. Pieck is soon overwhelmed by the Scouts and is nearly killed before Falco Grice intervenes. Galliard manages to rip off one of the Attack Titan's arms and swipes at its head, but Eren blocks it with Lara Tybur's crystal, which is unexpectedly scratched by the Jaw Titan's claws. When the Scouts' airship arrives to extract their soldiers, Galliard attempts to switch targets only to be caught by Mikasa Ackermann, who severs his Titan's legs. Eren removes the Jaw Titan's remaining limbs before shoving Lara's crystal between its jaws. He then forces its jaws closed to crack the crystal and swallow the blood and spinal fluid belonging to the War Hammer Titan. Realizing that Galliard is next to be eaten, Falco and Gabi Braun begin shouting for Reiner, who wakes up in time to transform and distract Eren.",
        "introSong" :"My War" ,
        "outroSong" : "Shock",
        "comments" : null
    },

    {
        "episodeNumber" : 67,
        "name" : "Assassin's Bullet",
        "releaseDate" : "2021-02-01",
        "img" :"https://static.wikia.nocookie.net/shingekinokyojin/images/3/39/Mikasa_and_Armin_watch_Sasha_pass_away.png/revision/latest/scale-to-width-down/200?cb=20210201131851" ,
        "summary" : "Tired after many battles in Liberio, Eren Jaeger beats back a weary Reiner Braun before retreating with Mikasa Ackermann to the Scout Regiment's airship. As the Scouts retreat, Gabi Braun chases after them with Falco Grice trying to stop her. She manages to kill Lobov and figures out how to use his omni-directional mobility gear to reel herself up to the airship. Before Falco's brother Colt can stop them, Gabi retracts the wire, carrying both her and Falco up. Once on board she manages to shoot Sasha Braus before she and Falco are overwhelmed by the Scouts. After hearing her talk about carrying on Zeke Jaeger's will, Jean Kirschtein brings the two into another room where Zeke is regenerating from the mock battle he had with Levi Ackermann, revealing that Zeke was actually working with the Scouts. Everything had gone according to plan, barring a few miscalculations; specifically the two children. However, Hange Zoë is unhappy with Eren for forcing the Scouts to come to his aid, and when Sasha passes away from her wounds, Jean blames Eren's actions for her loss.",
        "introSong" :"My War" ,
        "outroSong" : "Shock",
        "comments" : null
    },

    {
        "episodeNumber" : 68,
        "name" : "Brave Volunteers",
        "releaseDate" : "2021-02-08",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/1/18/The_Braus_family_comes_to_Sasha%27s_grave.png/revision/latest/scale-to-width-down/200?cb=20210208054358",
        "summary" : "Three years ago, Paradis Island captured the crew of a Marleyan ship thanks to the assistance of the Anti-Marleyan Volunteers who betray their fellow crew members. With the Volunteers' help, the Scout Regiment learns what Marley's military capabilities are and are able to construct a port of their own. The Volunteers were assembled by Zeke Jaeger, who relays a plan to protect the Eldian people through them. Eren correctly concludes that Zeke has discovered how to work around Karl Fritz's vow to renounce war, and that the two of them together could use the threat of waking the Wall Titans to hold the rest of the world at bay. In the present, Sasha Braus is mourned by her friends and family, including Nicolo, one of the captured Marleyans, who is now allowed to work as a chef. Wanting to connect with her grieving family, he invites them to eat where he works. Meanwhile, Levi shows Zeke where he will be staying, in a forest of giant trees, and Dot Pyxis has the Anti-Marleyan Volunteers detained in order to keep Zeke on a short leash. He is apologetic that he cannot afford to trust them given how helpful they have been the past few years. Armin is still saddened by the recent raid on Liberio, but feels they had no choice and compares it to Annie Leonhart's experience as he talks to her in her crystal.",
        "introSong" :"My War" ,
        "outroSong" : "Shock",
        "comments" : null
    },

    {
        "episodeNumber" :69 ,
        "name" : "A Sound Argument",
        "releaseDate" :"2021-02-15" ,
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/f/f6/Eren_wants_his_friends_to_live_long_lives.png/revision/latest/scale-to-width-down/200?cb=20210215013520",
        "summary" : "Two years ago, with assistance from Zeke Jaeger and the Anti-Marleyan Volunteers, Paradis Island was put in contact with an old ally in the nation of Hizuru. Their envoy, Kiyomi Azumabito laid out the three part plan to keep the island safe until a time it will not need to rely on threatening the world with the Rumbling. However, Hizuru's assistance came from a place of greed and a year later they would not help Paradis negotiate trade with other nations in hopes of keeping any profit from Paradis's resources for themselves. Hange Zoë concluded that the Scout Regiment would have to venture out into the world themselves and meet people firsthand. In the present, Eren Jaeger's behavior perplexes those around him, and his friends try to come to grips with the person which he currently is with the person they remember. Historia Reiss is now pregnant, which is delaying the transfer of Zeke's Beast Titan to her out of concern that the process could harm her or even kill her unborn child.",
        "introSong" :"My War" ,
        "outroSong" : "Shock",
        "comments" : null
    },

    {
        "episodeNumber" :70 ,
        "name" : "Deceiver",
        "releaseDate" : "2021-02-22",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/3/3e/Floch_argues_for_Eren%27s_release.png/revision/latest/scale-to-width-down/200?cb=20210630001710",
        "summary" : "Gabi Braun and Falco Grice escape prison and take refuge with the Braus family, who accept them as a pair of runaways. Kaya, one of the orphans who lives and works with them, is aware that the two are actually from Marley and takes them to where her mother was killed by a Titan four years ago. She asks them what her mother had done to deserve such a gruesome death, and is unable to accept Gabi's rhetoric about needing to pay for the sins of Eldians committed long ago. Falco explains that her mother was a victim of circumstance during an earlier mission and after coming to terms with that, Kaya offers to take them to meet a Marleyan at the restaurant the Braus family is going to, in hopes of finding a way to get Gabi and Falco home. Elsewhere, Hange Zoë is forced to deal with insubordination when Floch Forster and three other members of the Scout Regiment are caught leaking information about Eren Jaeger's imprisonment. In Marley, the military has realized that Zeke Jaeger has faked his death and likely sided with Paradis Island. Rather than wait six months for a global offensive, Reiner Braun suggests they make a surprise attack before Zeke can come up with a defensive plan.",
        "introSong" :"My War" ,
        "outroSong" : "Shock",
        "comments" : null
    },

    {
        "episodeNumber" : 71,
        "name" : "Guides",
        "releaseDate" : "2021-03-01",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/5/52/Onyankopon_protests_the_treatment_of_the_volunteers.png/revision/latest/scale-to-width-down/200?cb=20210301055248",
        "summary" :"Yelena admits to Dot Pyxis that ten months ago, she secretly met with Eren Jaeger, requesting that he apply pressure on the military to act. She suspected that left to their own devices, the military would debate and put matters off until it was too late. Not even the other Anti-Marleyan Volunteers were aware. Onyankopon tells Hange Zoë that Yelena was the one who organized them, and friends who doubted them tended to die 'accidental' deaths. At headquarters, Dhalis Zachary is killed by a bomb placed by Jaegerists hidden in the military. Around a hundred soldiers openly defect in support of Eren, many of them from the Scout Regiment. Knowing that Eren's followers want to connect him with his brother Zeke, Pyxis tightens security to use Zeke's location as a bargaining chip. Hange believes that Zeke planned for this eventuality, so they want to look into Yelena's placement of Marleyan prisoners in certain lines of work." ,
        "introSong" :"My War" ,
        "outroSong" : "Shock",
        "comments" : null
    },

    {
        "episodeNumber" :72 ,
        "name" : "Children of the Forest",
        "releaseDate" : "2021-03-08",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/d/db/Levi_and_Zeke_talk_about_Ragako.png/revision/latest/scale-to-width-down/200?cb=20210307232010",
        "summary" : "Zeke Jaeger claims to have used gas mixed with his spinal fluid to transform the villagers of Ragako four years ago. He says he did not want to do it, but it was to provide cover while he was working for Marley. Levi Ackermann distrusts him though, because regardless of which side Zeke is truly working for, he does not seem to regret the lives taken. Nicolo treats the Braus family at the restaurant where he works. Gabi Braun and Falco Grice make contact with him, in hopes of finding a way home, but Nicolo attacks her with a wine bottle when he learns that she is the one who killed Sasha Braus. Falco takes the brunt of the attack for her and is knocked unconscious. Both the Braus family and the Scouts intervene with Artur Braus choosing to forgo revenge. Subdued, Nicolo asks the Scouts to clean the wine out of Falco's mouth because it is probably tainted with Zeke's spinal fluid. Before they can finish bathing Falco, Eren and the Jaegerists arrive and take everyone hostage.",
        "introSong" :"My War" ,
        "outroSong" : "Shock",
        "comments" : null
    },

    {
        "episodeNumber" :73 ,
        "name" : "Savagery",
        "releaseDate" : "2021-03-22",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/6/69/Eren_reveals_his_cut_palm.png/revision/latest/scale-to-width-down/200?cb=20210322220559",
        "summary" :"While Gabi Braun sits nervously, Eren Jaeger, Mikasa Ackermann, and Armin Arlelt sit down to talk. Armin questions Eren over attacking Liberio. Eren declares that he chose to do so of his own free will, though Mikasa disagrees, believing that he is being manipulated. Angered, he begins chastising the two for lacking freedom: Armin for being manipulated by Bertholdt Hoover's memories, and Mikasa for her Ackermann heritage. Speaking in disgust, Eren tells Mikasa that he has always hated her. Armin and Eren begin a fist fight, though the former is quickly beaten. Elsewhere, Levi Ackermann is informed about Dhalis Zachary's death, and tells the courier to let Dot Pyxis know of his plan to have Zeke eaten. As Levi is lost in his thoughts, Zeke darts off and lets out a scream. Levi's comrades fall from the surrounding trees, transformed into Titans. Levi is hesitant, but he soon steels himself to sacrifice the horde and begins ripping through them. He later catches up to Zeke and forces him to become the Beast Titan; however, Levi takes advantage of the Titan Forest to defeat him. Zeke's unconscious body is dragged out of the forest. Meanwhile, Floch Forster leads the Jaegerists to the Cadet Corps division in Shiganshina District." ,
        "introSong" :"My War" ,
        "outroSong" : "Shock",
        "comments" : null
    },

    {
        "episodeNumber" :74 ,
        "name" : "Sole Salvation",
        "releaseDate" :"2021-03-22" ,
        "img" :"https://static.wikia.nocookie.net/shingekinokyojin/images/1/15/The_Jaeger_brothers_meet_in_Marley.png/revision/latest/scale-to-width-down/200?cb=20210323001447" ,
        "summary" :"Zeke Jaeger recalls his childhood and how he was forced to become part of his parents' plan to free Eldia from Marley. He becomes friends with Tom Xaver, a member of the Titan research team and vows to inherit the Beast Titan from him. He goes on to say he will ensure the success of the plan to take back the Founding Titan. After recalling his memories, Zeke triggers the Thunder Spear, detonating it and catching Levi Ackermann by surprise." ,
        "introSong" :"My War" ,
        "outroSong" : "Shock",
        "comments" : null
    },

    {
        "episodeNumber" : 75,
        "name" : "Above and Below",
        "releaseDate" : "2021-03-29",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/7/78/The_Jaw_Titan_ambushes_Eren.png/revision/latest/scale-to-width-down/200?cb=20210330222442",
        "summary" : "Floch Forster, Hange Zoë, and a number of Jaegerists are traveling to a Forest of Giant Trees when they hear the explosion caused by Zeke Jaeger triggering a Thunder Spear. As Zeke succumbs to his wounds, a Titan crawls up to him and tears open its belly, stuffing his body inside. Meanwhile, Yelena has Dot Pyxis and other dissenting members of the military assembled in Shiganshina District. Eren Jaeger goes to meet with the imprisoned Gabi Braun, to have her send out a distress call to Marley in exchange for saving Falco Grice. However, a disguised Pieck approaches Eren and claims she wishes to help him destroy Marley. As a proof of her intentions, she offers to show Eren the location of her fellow spies in Paradis Island.",
        "introSong" :"My War" ,
        "outroSong" : "Shock",
        "comments" : null
    },

    {
        "episodeNumber" : 76,
        "name" : "Judgment",
        "releaseDate" :"2022-01-10" ,
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/0/09/Hange_finds_a_battered_Levi.png/revision/latest/scale-to-width-down/200?cb=20220110015243",
        "summary" : "The Marleyan invasion of Shiganshina District begins in earnest. Porco Galliard, Pieck Finger, and Gabi Braun escape their rooftop confrontation with Eren Jaeger and meet up with General Theo Magath who has brought a fleet of airships and army of soldiers with him. They outfit Pieck's Cart Titan as a mobile artillery platform in order to take down Eren's Founding Titan. Because he has not used its power yet, they suspect he can only do so when united with Zeke Jaeger. Eren fights along with the Jaegerists against the Marleyans, but is gradually overwhelmed between the opposing Titans and the constant shelling. Onyankopon fears that he will ultimately lose and be eaten. He runs to free Eren's friends, who have been imprisoned inside their own military headquarters, but is greeted with skepticism. They would like to stop the invasion, but helping Eren also means supporting the euthanization plan they do not approve of. Armin Arlelt tries suggesting that Eren is only appearing to cooperate with Yelena in order to keep her in line, but his words are met with silence.",
        "introSong" : "The Rumbling",
        "outroSong" : "Akuma no Ko",
        "comments" : null
    },

    {
        "episodeNumber" : 77,
        "name" : "Sneak Attack",
        "releaseDate" : "2022-01-17",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/3/33/Yelena_basks_beneath_the_damaged_airships.png/revision/latest/scale-to-width-down/200?cb=20220117020037",
        "summary" : "Eren Jaeger is granted a reprieve by the timely arrival of his older brother Zeke, who begins fending off the other Titans attacking him as well as assaulting the Marleyan airships up above. After some coercion, the previously imprisoned soldiers who did not cooperate with the Jaegerists are freed so they can help defend Paradis Island. Those who have not drunk the wine tainted by Zeke's spinal fluid are given omni-directional mobility gear and the remainder organize on foot under Dot Pyxis. Reinforcing Eren proves difficult however, and a ruse from Pieck Finger and Theo Magath give them a free shot with their artillery at Zeke, knocking his Beast Titan off of Wall Maria. When Falco Grice leaves the headquarters along with the formerly imprisoned soldiers, he spots his brother Colt. Nile Dawk reunites the two under the pretense of restraining Falco in a house, and the brothers leave along with Gabi Braun, who finally realizes that there are no devils on the island, just people. She apologizes to Falco for getting him involved, which prompts him to confess his feelings for her, since he is afraid he could turn into a Titan soon. On hearing that Falco drank the spinal fluid, Colt rushes them to Zeke, hoping that he will not scream if Falco is among the afflicted.",
        "introSong" : "The Rumbling",
        "outroSong" : "Akuma no Ko",
        "comments" : null
    },

    {
        "episodeNumber" :78 ,
        "name" : "Two Brothers",
        "releaseDate" : "2022-01-24",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/f/ff/Eren_is_decapitated.png/revision/latest/scale-to-width-down/200?cb=20220124002235",
        "summary" : "Colt Grice pleads with Zeke Jaeger to not use the Beast Titan's scream so his brother Falco is not transformed into a Titan. Zeke understands and likens Colt' s care for Falco to his care for Eren. Unfortunately, he proceeds to transform not just Falco, but every soldier in Shiganshina District who drank his spinal fluid. The Titans begin attacking the invading Marleyan military and Zeke commands the newly transformed Falco to attack Reiner Braun and free his own brother, Eren. Zeke is shot through the nape by Theo Magath and his artillery crew, but survives by playing dead and allowing his Beast Titan to dissolve. Realizing this, Eren traps Reiner by grabbing him and hardening his Titan, while escaping out the nape. He runs on foot to join Zeke, but is decapitated by Gabi Braun, who shoots him through the neck with a high-caliber, anti-Titan rifle. Eren wakes in the Paths with Zeke, who explains that this is where the royal family would command their ancestor Ymir to do their bidding. When Eren refuses to go along with the Eldian euthanasia plan, Zeke vows to use her power to force Eren see things his way.",
        "introSong" : "The Rumbling",
        "outroSong" : "Akuma no Ko",
        "comments" : null
    },

    {
        "episodeNumber" : 79,
        "name" : "Memories of the Future",
        "releaseDate" : "2022-01-31",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/9/9a/Grisha_collapses_following_his_escape.png/revision/latest/scale-to-width-down/200?cb=20220131033730",
        "summary" : "Zeke and Eren Jaeger travel through their father Grisha's memories as Zeke attempts to show Eren that Grisha only cared about him as a tool. However, he instead sees Grisha giving Eren freedom that Zeke never had as a child. Eren's determination and willingness to fight for his freedom are things he has always had on his own. When Grisha reacts to their presence in his memories, Zeke is surprised that Grisha has not forgotten about him. The day Wall Maria falls, they see Grisha confront Frieda Reiss in the underground chapel. Due to the vow to renounce war, she refuses to save the people of Wall Maria and insists the Eldians atone for their ancestors' crimes by accepting the world's hatred of them. Grisha reveals that he was led here by future memories he received through the Attack Titan. He plans to kill her to obtain the Founding Titan and end the royal bloodline, but falters because he does not want to murder children. Eren intervenes, and using the fact Grisha can hear him through his future memories, convinces Grisha to go ahead with the attack. Following the massacre, Grisha apologizes to Zeke, saying he was a terrible father, and asks him to stop Eren.",
        "introSong" : "The Rumbling",
        "outroSong" : "Akuma no Ko",
        "comments" : null
    },

    {
        "episodeNumber" : 80,
        "name" : "From You, 2,000 Years Ago",
        "releaseDate" : "2022-02-07",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/6/6b/Eren_declares_annihilation_on_the_world.png/revision/latest/scale-to-width-down/200?cb=20220207062630",
        "summary" : "Zeke Jaeger is pushed out of Grisha's memories after learning that Eren manipulated their father into taking the Founding Titan from the King of the Walls. However, Zeke realizes that Eren's ability to see the future has limitations, so he orders Ymir Fritz to remove the ability of all Eldians to reproduce. Eren breaks free of his chains to chase after her, and in doing so, learns her past. Ymir was enslaved as a child and while being hunted for sport, she came into contact with a mysterious creature that transformed her into a massive Titan. The leader of the tribe who enslaved her used her and her new power to expand the fortunes of his people and attack Marley. He had three daughters with her before Ymir died, saving him from an assassination attempt. After her death, her daughters were ordered to consume her flesh in order to keep her powers. Eren realizes her pain and tells Ymir she does not have to be a slave, and has a choice. In response, in the outside world, the Walls come down and the Rumbling begins.",
        "introSong" : "The Rumbling",
        "outroSong" : "Akuma no Ko",
        "comments" : null
    },

    {
        "episodeNumber" : 81,
        "name" : "Thaw",
        "releaseDate" : "2022-02-14",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/2/2f/Annie_awakens_after_four_years.png/revision/latest/scale-to-width-down/200?cb=20220213213809",
        "summary" : "The Titans created by Zeke Jaeger now run amok in Shiganshina District as Eren and the Wall Titans march to trample the rest of the world. Armin Arlelt, Mikasa Ackermann, and Jean Kirschtein rally the district's defense as Conny Springer escapes with an unconscious Falco Grice, whom he plans to feed to his his mother to make her human again. In the Titan-filled streets, Gabi Braun saves Kaya from a Titan and the rift between the two begins to mend. After the fighting dies down, the Braus family takes her to meet Armin and Mikasa. She explains her intent to find Falco and then leave, but is horrified to learn of Conny's plans. Gabi pleads with Armin to talk with Eren so everyone outside the island does not have to die, asking that he hit specific targets like he undid the Armored Titan's hardening. On hearing this, Armin realizes that all Titan hardening has been undone, not just the Walls', which means that Annie Leonhart is now free.",
        "introSong" : "The Rumbling",
        "outroSong" : "Akuma no Ko",
        "comments" : null
    },

    {
        "episodeNumber" :82 ,
        "name" : "Sunset",
        "releaseDate" : "2022-02-21",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/b/b5/Pieck_and_Magath_watch_the_airships_leave.png/revision/latest/scale-to-width-down/200?cb=20220221052118",
        "summary" : "Hitch Dreyse unexpectedly reunites with Annie Leonhart and helps her escape the ruins of Trost District following the collapse of the Walls and the march of the Wall Titans. Annie explains the complex feelings that brought her this far and how the one thing she wants to do now is reunite with her father. Leonhart, however, has problems of his own as he and the other Eldians in Liberio's internment zone try convincing the guards of the imminent rumbling to no avail. Meanwhile, Armin Arlelt and Gabi Braun try catching up with Conny Springer before he can sacrifice Falco Grice to make his mother human again. Floch solidifies his control over what remains of Paradis Island's military, explaining that Eren Jaeger confided his plans to him ten months ago. Outside Shiganshina District, Hange Zoë approaches Pieck Finger and Theo Magath to talk.",
        "introSong" : "The Rumbling",
        "outroSong" : "Akuma no Ko",
        "comments" : null
    },

    {
        "episodeNumber" : 83,
        "name" : "Pride",
        "releaseDate" : "2022-02-28",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/7/7a/Conny_saves_Armin_from_being_eaten.png/revision/latest/scale-to-width-down/200?cb=20220303095118",
        "summary" :"Hange Zoë and Levi Ackermann establish an agreement to work together with Theo Magath and Pieck Finger. Meanwhile, Armin Arlelt tries to save Falco Grice from Conny Springer's attempt to feed him to his mother's Titan in order to restore her humanity. Realizing that Armin means to sacrifice himself instead, Conny drops Falco to save Armin and the two reconcile with Conny resolving to save others and become a soldier his mother would be proud of. Back in Shiganshina District, Floch Forster begins the execution proceedings for Yelena and Onyankopon, and reads out their crimes against the Eldian Empire. Onyankopon tries appealing to Jean Kirschtein for understanding, and Jean takes out a gun, firing four times. This turns out to be a signal and the Cart Titan charges in and escapes after snatching Jean and the captives in its mouth. At the same time the Jaegerist soldiers are distracted by the Cart Titan, Armin and his group escape out the other side of the fort, taking wagons of supplies with them." ,
        "introSong" : "The Rumbling",
        "outroSong" : "Akuma no Ko",
        "comments" : null
    },

    {
        "episodeNumber" :84 ,
        "name" : "Night of the End",
        "releaseDate" : "2022-03-07",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/2/27/Jean_beats_Reiner_up.png/revision/latest/scale-to-width-down/200?cb=20220307042410",
        "summary" : "The portion of the Scout Regiment still led by Hange Zoë shares an uneasy campfire with Theo Magath and the remaining Warriors. The two sides are suspicious of each other given their respective histories and Annie Leonhart's skepticism that Eren Jaeger's friends will be able to kill him in the event that diplomacy fails. Yelena tries to fan the flames of that division, but largely fails until she brings up the death of Marco Bodt. Reiner Braun takes responsibility for that, but overemphasizes his feelings of guilt to Jean Kirschtein, who does not want to hear how awful Reiner feels about it. He begins to beat down Reiner, only to hit Gabi Braun by accident when she tries to protect her cousin. Gabi understands that Jean has good reasons for hating the Warriors, but pleads with him to help save her family in Liberio. Though he needs time to cool off, Jean agrees and the combined group heads towards the port where they expect to find a flying boat they can use to chase after Eren.",
        "introSong" : null,
        "outroSong" : "Akuma no Ko",
        "comments" : null
    },

    {
        "episodeNumber" :85 ,
        "name" :"Traitor" ,
        "releaseDate" : "2022-03-14",
        "img" :"https://static.wikia.nocookie.net/shingekinokyojin/images/8/83/Reiner_transforms_to_fight_at_the_port.png/revision/latest/scale-to-width-down/200?cb=20220314044637" ,
        "summary" : "The combined forces of Hange Zoë's remaining Scouts and Theo Magath's remaining Warriors plan on escaping Paradis Island on the flying boat, which is kept in the Jaegerist occupied port. In order to do this, they need to prevent the flying boat's destruction by the Jaegerists and rescue the Azumabito family who are the only ones capable of servicing the aircraft. Armin Arlelt and Conny Springer attempt this through a peaceful deception, pretending to need the flying boat in order to chase after the Cart and Armored Titans, but when Floch Forster decides it would be safer to eliminate the Azumabito, the combined group is forced into a battle. The Azumabito are guided to the basement by Mikasa Ackermann and others, where they can be protected while Annie Leonhart and Reiner Braun use their Titans to fight the Jaegerists. At the dock, Conny is forced to kill Daz and Samuel Linke-Jackson in order to save Armin's life and prevent the destruction of the flying boat.",
        "introSong" : "The Rumbling",
        "outroSong" : "Akuma no Ko",
        "comments" : null
    },

    {
        "episodeNumber" :86 ,
        "name" : "Retrospective",
        "releaseDate" : "2022-03-21",
        "img" : "https://static.wikia.nocookie.net/shingekinokyojin/images/4/4a/Floch_aims_at_the_ship.png/revision/latest/scale-to-width-down/200?cb=20220321032557",
        "summary" : "Upon learning that the Azumabito mechanics need a minimum of half a day in order to prepare the flying boat for take off, Theo Magath agrees to Kiyomi Azumbabito's suggestion that they escape the port on the Azumabito ship and tow the flying boat with them to Odiha in Marley where her family has a hanger. Though Liberio will be lost to the delay, Odiha is far enough away that they should arrive before the rumbling.   Hange Zoë and Magath's combined forces manage to repel the Jaegerists long enough for everyone to board the ship, though they are briefly delayed by the rampage of Falco Grice's first transformation as the Jaw Titan. After seeing everyone on board, Magath orders Onyankopon to set sail while he stays behind. Together with Keith Sadies, Magath boards a captured Marleyan cruiser capable of catching up to the Azumabito ship. He and Keith exchange words of mutual respect before blowing up the ship's magazine and sinking the cruiser.",
        "introSong" : "The Rumbling",
        "outroSong" : "Akuma no Ko",
        "comments" : null
    },
    {
        "episodeNumber" :87 ,
        "name" : "The Dawn of Humanity",
        "releaseDate" : "2022-04-04",
        "img" :"https://static.wikia.nocookie.net/shingekinokyojin/images/5/58/Eren%27s_Founding_Titan_reaches_Marley.png/revision/latest/scale-to-width-down/200?cb=20220404153938" ,
        "summary" : "Mikasa Ackermann recalls the Scout Regiment's first trip to Marley, where they had joyful moments such as discovering ice cream and connecting with refugees from the Marley Mid-East War, but also disappointments, in that the Subjects of Ymir Protection Group was not the ally the Scouts hoped they would be. That was when Eren Jaeger left the Scouts and began operating on his own, telling them that he would follow his brother Zeke's plan. Mikasa wonders if they could have made choices so things would have turned out differently. Meanwhile, Eren recalls the events that had led him here; how he had met Yelena and learned of Zeke's euthanasia plan, how he had confided in Floch Forster that he would only pretend to go along with Zeke's plan when in reality he would use the rumbling to wipe out the rest of the world, and how he had tried and failed to persuade Historia Reiss to fight or flee before the Military Police turned her into a Titan to eat Zeke. A fleet of ships tries to stop Eren's army of Wall Titans, but fails, and his Titans finally arrive at Marley's shores.",
        "introSong" : null,
        "outroSong" : null,
        "comments" : null
    }

]